// import 'package:flutter/material.dart';
// import 'package:get/get_connect/http/src/utils/utils.dart';

// import '../../size_config.dart';

// class TestScreen extends StatefulWidget {
//   const TestScreen({
//     super.key,
//   });

//   @override
//   State<TestScreen> createState() => _TestScreenState();
// }

// class _TestScreenState extends State<TestScreen> with TickerProviderStateMixin {
//   PageController controller = PageController();

//   List<String> page = [
//     '''إِنَّا  مَكَّنَّا  لَهُۥ  فِي  ٱلۡأَرۡضِ  وَءَاتَيۡنَٰهُ  مِن  كُلِّ  شَيۡءٖ  سَبَبٗا ٨٤  فَأَتۡبَعَ 
// سَبَبًا ٨٥  حَتَّىٰٓ  إِذَا  بَلَغَ  مَغۡرِبَ  ٱلشَّمۡسِ  وَجَدَهَا  تَغۡرُبُ  فِي  عَيۡنٍ  حَمِئَةٖ 
// وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ 
// فِيهِمۡ حُسۡنٗا ٨٦ قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ 
// فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا ٨٧ وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً 
// ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا ٨٨ ثُمَّ أَتۡبَعَ سَبَبًا ٨٩ حَتَّىٰٓ 
// إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن 
// دُونِهَا سِتۡرٗا ٩٠ كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا ٩١ ثُمَّ 
// أَتۡبَعَ سَبَبًا ٩٢ حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا 
// لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا ٩٣ قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ 
// وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن 
// تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا ٩٤ قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي 
// بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ٩٥ ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ 
// بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ 
// قِطۡرٗا ٩٦ فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا ٩٧ 
// ''',
//     '''قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي 
// حَقّٗا ٩٨ ۞ وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَئِذٖ يَمُوجُ فِي بَعۡضٖۖ وَنُفِخَ فِي ٱلصُّورِ 
// فَجَمَعۡنَٰهُمۡ جَمۡعٗا ٩٩ وَعَرَضۡنَا جَهَنَّمَ يَوۡمَئِذٖ لِّلۡكَٰفِرِينَ عَرۡضًا ١٠٠ ٱلَّذِينَ 
// كَانَتۡ أَعۡيُنُهُمۡ فِي غِطَآءٍ عَن ذِكۡرِي وَكَانُواْ لَا يَسۡتَطِيعُونَ سَمۡعًا ١٠١ 
// أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ 
// أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا ١٠٢ قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِينَ أَعۡمَٰلًا ١٠٣ 
// ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ 
// صُنۡعًا ١٠٤ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ 
// أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا ١٠٥ ذَٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ 
// بِمَا كَفَرُواْ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَرُسُلِي هُزُوًا ١٠٦ إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ 
// ٱلصَّٰلِحَٰتِ كَانَتۡ لَهُمۡ جَنَّٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا ١٠٧ خَٰلِدِينَ فِيهَا 
// لَا يَبۡغُونَ عَنۡهَا حِوَلٗا ١٠٨ قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ 
// ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا ١٠٩ قُلۡ إِنَّمَآ 
// أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَمَن كَانَ يَرۡجُواْ 
// لِقَآءَ رَبِّهِۦ فَلۡيَعۡمَلۡ عَمَلٗا صَٰلِحٗا وَلَا يُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦٓ أَحَدَۢا ١١٠
// ''',
//   ];
//   late AnimationController animationController;

//   @override
//   Widget build(BuildContext context) {
//     SizeConfig().init(context);
//     return Scaffold(
//       body: PageView.builder(
//         // shrinkWrap: true,
//         // controller: pageController,
//         physics: const ClampingScrollPhysics(),

//         itemCount: page.length,
//         itemBuilder: (context, index) {
//           return Column(
//             mainAxisAlignment: MainAxisAlignment.center,
//             children: [
//               // Center(
//               //     child: Text(
//               //   page[index],
//               //   textAlign: TextAlign.center,
//               //   style: TextStyle(
//               //     fontFamily: 'uthmani',
//               //     fontSize: getProportionateScreenWidth(15),
//               //     // height: textHight,
//               //   ),
//               // )),
//               // const Divider(),
//               FittedBox(
//                 fit: BoxFit.fitWidth,
//                 child: SizedBox(
//                   width: SizeConfig.screenWidth,
//                   child: Text(
//                     page[index],
//                     textAlign: TextAlign.center,
//                     textDirection: TextDirection.rtl, // تحديد اتجاه النص
//                     style: TextStyle(
//                       fontFamily: 'uthmani', // الخط المستخدم في المصحف
//                       fontSize: getProportionateScreenWidth(15),
//                       color: Colors.black,
//                     ),
//                   ),
//                 ),
//               ),

//               // Center(
//               //     child: RichText(
//               //   text: TextSpan(
//               //       text: page[index],
//               //       style: TextStyle(
//               //         // textBaseline: TextBaseline.ideographic,
//               //         fontFamily: 'uthmani',
//               //         color: Colors.black,
//               //         fontSize: getProportionateScreenWidth(16),
//               //       )),
//               //   textAlign: TextAlign.center,
//               //   textScaler: const TextScaler.linear(1.1),
//               // )),
//             ],
//           );
//         },
//       ),

//       // : const Text('loading'),
//     );
//   }
// }
